app/controllers/api/accounts_controller.rb

  def show
    @object = Account.find_by_id params[:id]
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1

  def create

      # @object = Account.new(params[:account])

    params[:account][:user_id] = current_user.id
    @object = Account.create_object( params[:account] , false  )
---
INSERT INTO "accounts" ("created_at", "lft", "name", "parent_id", "rgt", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", Wed, 28 May 2014 09:35:50 UTC +00:00], ["lft", 9], ["name", "TOL"], ["parent_id", 2], ["rgt", 10], ["updated_at", Wed, 28 May 2014 09:35:50 UTC +00:00], ["user_id", 1]]