app/controllers/api/contacts_controller.rb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = 5 LIMIT 1
UPDATE "contacts" SET "name" = $1, "updated_at" = $2 WHERE "contacts"."id" = 4  [["name", "CONTACT NAME 4 HAHAHA"], ["updated_at", Wed, 28 May 2014 08:55:28 UTC +00:00]]
---
  def update

    @object = Contact.find_by_id params[:id]
    @object.update_object( params[:contact])

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", "4"]]
---
  def destroy
    @object = Contact.find(params[:id])