app/controllers/api/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."customer_id" = 2 ORDER BY id DESC LIMIT 10 OFFSET 10
SELECT COUNT(*) FROM "items" WHERE "items"."customer_id" = 2
---
  def index



    if params[:livesearch].present?
      livesearch = "%#{params[:livesearch]}%"
      @objects = Item.where{
        (
          (name =~  livesearch ) |
          (code =~  livesearch )
        )

      }.page(params[:page]).per(params[:limit]).order("id DESC")

      @total = Item.where{
        (
          (name =~  livesearch ) |
          (code =~  livesearch )
        )
      }.count

      # calendar

    elsif params[:parent_id].present?
      # @group_loan = GroupLoan.find_by_id params[:parent_id]
      @objects = Item.
                  where(:customer_id => params[:parent_id]).
                  page(params[:page]).per(params[:limit]).order("id DESC")

INSERT INTO "items" ("created_at", "customer_id", "description", "manufactured_at", "type_id", "updated_at", "warranty_expiry_date") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @object = Item.create_object( params[:item] )