app/controllers/api/projects_controller.rb

  def update

    @object = Project.find_by_id params[:id]
    @object.update_object( params[:project])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 4 LIMIT 1
UPDATE "projects" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "projects"."id" = 4  [["name", "PROJECT NAME 4 AHHA"], ["description", ""], ["updated_at", Wed, 28 May 2014 10:18:25 UTC +00:00]]