app/controllers/api/types_controller.rb

  def create
    @object = Type.create_object( params[:type] )
---
INSERT INTO "types" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 30 Apr 2014 10:44:18 UTC +00:00], ["description", "jaringan lapangan. belum termasuk microtik"], ["name", "NETWORK"], ["updated_at", Wed, 30 Apr 2014 10:44:18 UTC +00:00]]

  def update

    @object = Type.find_by_id params[:id]
    @object.update_object( params[:type])
---
SELECT "types".* FROM "types" WHERE "types"."id" = 4 LIMIT 1
UPDATE "types" SET "description" = $1, "updated_at" = $2 WHERE "types"."id" = 4  [["description", "Software Freight forwarding "], ["updated_at", Fri, 02 May 2014 05:15:28 UTC +00:00]]

  def destroy
    @object = Type.find(params[:id])
---
SELECT "types".* FROM "types" WHERE "types"."id" = $1 LIMIT 1  [["id", "1"]]

  def search
    search_params = params[:query]
    selected_id = params[:selected_id]
    if params[:selected_id].nil?  or params[:selected_id].length == 0
      selected_id = nil
    end

    query = "%#{search_params}%"
    # on PostGre SQL, it is ignoring lower case or upper case

    if  selected_id.nil?
      @objects = Type.where{ (name =~ query)
                              }.
                        page(params[:page]).
                        per(params[:limit]).
                        order("id DESC")

      @total = Type.where{ (name =~ query)
---
SELECT COUNT(*) FROM "types" WHERE "types"."name" ILIKE '%%'