app/controllers/api/venues_controller.rb

  def update

    @object = Venue.find_by_id params[:id]
    @object.update_object( params[:venue])
---
SELECT "venues".* FROM "venues" WHERE "venues"."id" = 4 LIMIT 1
UPDATE "venues" SET "name" = $1, "updated_at" = $2 WHERE "venues"."id" = 4  [["name", "VENUE NAME 4 44"], ["updated_at", Wed, 28 May 2014 09:02:30 UTC +00:00]]

  def destroy
    @object = Venue.find(params[:id])
---
SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "4"]]